# Pandas 动手学入门
本课程基于[DataWhale开源教程《Joyful-Pandas》](http://joyfulpandas.datawhale.club/index.html)与[开源项目 ajcr/100-pandas-puzzles](https://github.com/ajcr/100-pandas-puzzles)其[中译版](https://github.com/VXenomac/100-pandas-puzzles-cn)开发. 在数据分析的实践中，Pandas是一个非常重要的库，它集成了非常多的统计分析功能，[《Joyful-Pandas》](http://joyfulpandas.datawhale.club/index.html)是一份非常详尽，并且适合新手的Pandas中文教程，同时它也是Pandas官方认证的中文教程！但笔者学习过程中，始终觉得编程学习“纸上得来终觉浅”，对于刚接触一个新的库的“躬行”笔者认为最好的方式就是对照着官方文档以及QuickStart吧例子自己尝试一遍，并且在实践中学会如何查文档，这是一个开发者必备的技能.因此本教程就是基于这样的思想，给出对应的操作以及对应的文档地址，学习者需要自行查阅文档，完成下面的实践.

## 餐前准备
在这部分中，我们主要学习如何导入Pandas以及查看版本信息，难度是比较简单的.
> 请你阅读Joyful-Pandas第二章，完成下方练习.
http://joyfulpandas.datawhale.club/Content/ch2.html

**1.** 以 `pd` 别名导入 pandas 库

In [1]:
import pandas as pd

**2.** 打印出pandas 库的版本信息

In [2]:
print(pd.__version__)

1.3.3

**3.** 打印 pandas 依赖包及其版本信息

## 备齐食材
在这部分中，主要介绍了Pandas一个重要的数据结构```DataFrame```

> 请你阅读Joyful-Pandas第二章，完成下方练习.
http://joyfulpandas.datawhale.club/Content/ch2.html

**4.** 使用数据 `data` 和行索引 `labels` 创建一个 DataFrame `df`

In [3]:
import numpy as np

有下面这样的一个数据字典 `data` 以及列表格式的标签数据 `labels`:

In [4]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [99]:
df = pd.DataFrame(data=data,index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

**5.** 显示该 DataFrame 及其数据相关的基本信息（*提示：DataFrame 直接调用的方法*）

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

**6.** 返回 DataFrame `df` 的前4行数据

In [7]:
df.head(4)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes

**7.** 从 DataFrame `df` 选择标签为 `animal` 和 `age` 的列

In [8]:
# 第一种方法
df[['animal','age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

In [9]:
# 第二种方法
df.iloc[:,[0,1]]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

**8.** 在 `[3, 4, 8]` 行中，列为 `['animal', 'age']` 的数据

In [10]:
df.iloc[[2,3,7]][['animal','age']]

  animal  age
c  snake  0.5
d    dog  NaN
h    cat  NaN

In [11]:
df.iloc[[2,3,7],[0,1]]

  animal  age
c  snake  0.5
d    dog  NaN
h    cat  NaN

**9.** 选择列```visits``` 大于 3 的行

In [12]:
#第一种方法
df.loc[df['visits'] > 3]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

In [13]:
# 第二种方法
df.iloc[(df['visits']>3).values]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

In [14]:
# 第三种方法
df[df['visits'] > 3]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

**10.** 选择 `age` 为缺失值的行

In [15]:
df[df['age'].isna()]
df[df.age.isna()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

**11.** 选择 `animal` 是cat且`age` 小于 3 的行

In [16]:
contions1 = df['animal'] == 'cat'
contions2 = df['age'] < 3
df.loc[contions1 & contions2]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

In [17]:
# 第二种方法
df[contions1 & contions2]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

**12.** 选择 `age` 在 2 到 4 之间的数据（包含边界值）

In [18]:
df[df['age'] > 2][df['age'] <=4]

C:\Users\Lenovo\AppData\Local\Temp/ipykernel_69560/1212654509.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df[df['age'] > 2][df['age'] <=4]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
j    dog  3.0       1       no

In [19]:
contions3 = df['age'] >2
contions4 = df['age'] <= 4
df.loc[contions3 & contions4]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
j    dog  3.0       1       no

In [20]:
df[contions3 & contions4]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
j    dog  3.0       1       no

**13.** 将 'f' 行的 `age` 改为 1.5

在对表或者序列赋值时，应当在使用一层索引器后直接进行赋值操作，这样做是由于进行多次索引后赋值是赋在临时返回的 copy 副本上的，而没有真正修改元素从而报出 SettingWithCopyWarning 警告

In [21]:

df.loc['f','age'] = 1.5
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

**14.** 对 `visits` 列的数据求和

In [22]:
df['visits'].sum()

19

**15.** 计算每种 `animal` `age` 的平均值

In [100]:
df.groupby('animal')['age'].mean()

animal
cat      2.5
dog      5.0
snake    2.5
Name: age, dtype: float64

**16.** 新增一行数据 k，数据自定义，然后再删除新追加的 k 行

In [101]:
append_data = {
    'animal':'snake',
    'age':'2.0',
    'visits':'3',
    'priority':'yes'
}
df.loc['k'] = append_data
df.drop(index='f',inplace=True)

**17.** 统计每种 `animal` 的个数

In [102]:
# 得到唯一值和所对应出现的频数
df['animal'].value_counts()

dog      4
cat      3
snake    3
Name: animal, dtype: int64

**18.** 先根据 `age` 降序排列，再根据 `visits` 升序排列（结果 `i` 列在前面，`d` 列在最后面）

In [103]:
df['age'][9] = 2.0
df.sort_values(by=['age','visits'],ascending=[False,True])

  animal  age visits priority
i    dog  7.0      2       no
e    dog  5.0      2       no
g  snake  4.5      1       no
j    dog  3.0      1       no
b    cat  3.0      3      yes
a    cat  2.5      1      yes
k  snake  2.0      3      yes
c  snake  0.5      2       no
h    cat  NaN      1      yes
d    dog  NaN      3      yes

**19.** 将 `priority` 列的 `yes` 和 `no` 用 `True` 和 `False` 替换

In [27]:
df['priority'].replace(['yes','no'],[True,False],inplace=True)
df

  animal  age visits  priority
a    cat  2.5      1      True
b    cat  3.0      3      True
c  snake  0.5      2     False
d    dog  NaN      3      True
e    dog  5.0      2     False
g  snake  4.5      1     False
h    cat  NaN      1      True
i    dog  7.0      2     False
j    dog  3.0      1     False
k  snake  2.0      3      True

**20.** 将 `animal` 列的 `snake` 用 `python` 替换

In [104]:
df['animal'].replace('snake','python')

a       cat
b       cat
c    python
d       dog
e       dog
g    python
h       cat
i       dog
j       dog
k    python
Name: animal, dtype: object

**21.** 对于每种 `animal` 和 `visit`，求出平均年龄。换句话说，每一行都是动物，每一列都是访问次数，其值是平均年龄（提示：使用数据透视表）

In [111]:
pd.pivot_table(df,values="age",index="animal",columns='visits',aggfunc="mean")

visits    1    2    3    3
animal
cat     2.5  NaN  3.0  NaN
dog     3.0  6.0  NaN  NaN
snake   4.5  0.5  NaN  2.0

**22.** 读取`data`文件夹下的`boston.csv`文件，并尝试利用上面的方法自行分析，得出一些简单的结论.

In [29]:
boston_df = pd.read_csv('./data/boston.csv',sep=',')

In [30]:
# 查看数据的前十条
boston_df.head(10)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2
5,0.02985,0.0,2.18,0,0.458,6.430,58.7,6.0622,3,222.0,18.7,394.12,5.21,28.7
6,0.08829,12.5,7.87,0,0.524,6.012,66.6,5.5605,5,311.0,15.2,395.60,12.43,22.9
7,0.14455,12.5,7.87,0,0.524,6.172,96.1,5.9505,5,311.0,15.2,396.90,19.15,27.1
8,0.21124,12.5,7.87,0,0.524,5.631,100.0,6.0821,5,311.0,15.2,386.63,29.93,16.5
9,0.17004,12.5,7.87,0,0.524,6.004,85.9,6.5921,5,311.0,15.2,386.71,17.10,18.9

In [31]:
# 查看数据的信息
boston_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 506 entries, 0 to 505
Data columns (total 14 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   CRIM     506 non-null    float64
 1   ZN       506 non-null    float64
 2   INDUS    506 non-null    float64
 3   CHAS     506 non-null    int64
 4   NOX      506 non-null    float64
 5   RM       506 non-null    float64
 6   AGE      506 non-null    float64
 7   DIS      506 non-null    float64
 8   RAD      506 non-null    int64
 9   TAX      506 non-null    float64
 10  PTRATIO  506 non-null    float64
 11  B        506 non-null    float64
 12  LSTAT    506 non-null    float64
 13  MEDV     506 non-null    float64
dtypes: float64(12), int64(2)
memory usage: 55.5 KB

从上面看到，总共有506条数据，每条数据一共14个变量，且没有空值。

In [32]:
boston_df['CHAS'].value_counts()

0    471
1     35
Name: CHAS, dtype: int64

根据上面，可以看出CHAS列的值由两类值组成，一个为1，一个为0。可以根据实际项目的需要转换数据。

In [33]:
# 查看RAD的值
boston_df['RAD'].value_counts()

24    132
5     115
4     110
3      38
6      26
2      24
8      24
1      20
7      17
Name: RAD, dtype: int64

RAD的值的组成

至此，相信你已经可以通过阅读文档，掌握了pandas中`DataFrame`的一些基本操作，下面我们来讲点更进一步的操作，它是上述这些操作的一些巧妙结合

## 食材搭配
在这个部分中，我们主要介绍对于DataFrame中的数据的一些操作：去重、数据计算、取值······
> 请你阅读Joyful-Pandas第二章，完成下方练习. http://joyfulpandas.datawhale.club/Content/ch2.html

In [34]:
dfs = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
dfs

    A
0   1
1   2
2   2
3   3
4   4
5   5
6   5
7   5
8   6
9   7
10  7

**23.** 请用pandas操作输出上面的`df`中`A`列出现的元素的唯一值（即：出现过的所有元素的集合）

In [35]:
dfs['A'].unique()

array([1, 2, 3, 4, 5, 6, 7], dtype=int64)

**24.** 输出`df`中的唯一值及其对应出现的频数

In [36]:
dfs['A'].value_counts()

5    3
2    2
7    2
1    1
3    1
4    1
6    1
Name: A, dtype: int64

**25.** 将`df`进行数据降重

In [37]:
dfs.drop_duplicates('A')

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

**26.** 给定一组随机数据

In [38]:
df = pd.DataFrame(np.random.random(size=(5, 3))) 
df

          0         1         2
0  0.369907  0.633884  0.406006
1  0.162880  0.752129  0.806320
2  0.448462  0.283807  0.144486
3  0.341184  0.900778  0.609062
4  0.542662  0.857707  0.049382

使每个元素减去所在行的平均值？

In [39]:
# 运用apply函数
def my_func(x):
    return x - x.mean()
df.apply(my_func,axis=0)
df.apply(lambda x : x - x.mean())

          0         1         2
0 -0.003112 -0.051777  0.002955
1 -0.210139  0.066468  0.403269
2  0.075443 -0.401854 -0.258565
3 -0.031835  0.215117  0.206011
4  0.169643  0.172046 -0.353669

**27.** 返回下列`df`数字总和最小那列的标签

In [40]:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
df

,a,b,c,d,e,f,g,h,i,j
0,0.120923,0.455250,0.341386,0.442281,0.040641,0.413067,0.245717,0.285770,0.884614,0.423628
1,0.478582,0.339006,0.340369,0.094044,0.889292,0.293598,0.467361,0.830900,0.424685,0.515256
2,0.360253,0.166862,0.037758,0.130793,0.174407,0.727398,0.892512,0.360378,0.952215,0.562137
3,0.453473,0.572351,0.731612,0.795932,0.447079,0.146045,0.853080,0.675530,0.352207,0.737370
4,0.030510,0.467147,0.582213,0.653850,0.167427,0.822866,0.890783,0.284460,0.740371,0.563141

In [41]:
def my_func2(x):
    x_sum = x.sum()
    return x_sum
index = df.apply(my_func2,axis=1).argmin()
df.columns[index]

'a'

**28.** 计算一个 DataFrame 有多少不重复的行？

In [42]:
df = pd.DataFrame(np.random.randint(0, 2, size=(10, 3)))
df

   0  1  2
0  0  1  0
1  1  0  0
2  0  0  0
3  0  1  0
4  1  0  0
5  1  0  0
6  1  0  1
7  0  1  1
8  0  1  0
9  0  1  0

In [43]:
# df.size/df.ndim -df.duplicated().sum()
df.duplicated().value_counts()

False    5
True     5
dtype: int64

**29.** DataFrame 数据如下，A 和 B 都是 0-100 之间（包括边界值）的数值，对 A 进行分段分组（i.e. (0, 10], (10, 20], ...），求每组内 B 的和。输出应该和下述一致：
```
A
(0, 10]      635
(10, 20]     360
(20, 30]     315
(30, 40]     306
(40, 50]     750
(50, 60]     284
(60, 70]     424
(70, 80]     526
(80, 90]     835
(90, 100]    852
```

In [125]:
df = pd.DataFrame(np.random.RandomState(8765).randint(1, 101, 
                  size=(100, 2)), 
                  columns = ["A", "B"])
df

     A   B
0   46  29
1   75  22
2   49  63
3   33  43
4   71  75
..  ..  ..
95  60  87
96  57  40
97  86  19
98  50  56
99  97  94

[100 rows x 2 columns]

In [128]:
df.groupby("A").

AttributeError: 'DataFrameGroupBy' object has no attribute 'cut'

## 用pandas进行数据清洗
下面的`df`是我们用到的数据集

In [119]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

**30.**  **FlightNumber**列中的某些值缺失（它们是NaN）。这些数字是有规律的，即每行增加 10，因此`NaN`需要放置 10055 和 10075。修改`df`以填充这些缺失的数字并使该列成为整数列（而不是浮点列）

In [120]:
df['FlightNumber'].interpolate(inplace=True)

**31.** **From_To**列作为两个单独的列会更好！拆分下划线分隔符`_`前后的每个字符串. 将其拆分成两列，存放在一个名为“temp”的临时 DataFrame，将列名 'From' 和 'To' 分配给这个临时DataFrame.

In [121]:
temp = df['From_To'].str.split('_',expand=True)
temp.columns = 'From_To'.split('_')
temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

**32.** 注意城市名称的大小写是混合在一起的。标准化字符串，以便只有第一个字母是大写的（例如“londON”应该变成“London”。）

In [122]:
temp = temp.apply(lambda x : x.str.title(),axis=1)
temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

**33.** 将`From_To`列从`df`中删去，将`temp`处理好的数据合并到`df`中

In [123]:
# df.drop('From_To',axis=1,inplace=True)
# df.join(temp)
# pd.merge(temp,df,how='left',left_index=True,right_index=True)
df = pd.concat([temp,df],axis=1)
df

,From,To,From_To,FlightNumber,RecentDelays,Airline
0,London,Paris,LoNDon_paris,10045.0,"[23, 47]",KLM(!)
1,Madrid,Milan,MAdrid_miLAN,10055.0,[],<Air France> (12)
2,London,Stockholm,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. )
3,Budapest,Paris,Budapest_PaRis,10075.0,[13],12. Air France
4,Brussels,London,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air"""

**34.**在`AirLine`列中，您可以看到航空公司名称周围出现了一些额外的符号。只提取航空公司名称。例如'(British Airways. )'应该变成'British Airways'.

In [ ]:
# 正则表达式构建查找

**35.** 在 RecentDelays 列中，值已作为列表输入到 DataFrame 中。我们希望每个第一个值在它自己的列中，每个第二个值在它自己的列中，依此类推。如果没有第 N 个值，则该值应为 NaN。

将 Series 列表展开为名为 的 DataFrame delays，重命名列delay_1，delay_2等等，并将不需要的 RecentDelays 列替换df为delays